heat-sim-blender/system/createBafflesDict
FoamFile
{
    format      ascii;
    class       dictionary;
    object      createBafflesDict;
}

// Exported by SnappyHexMesh GUI add-on for Blender v1.8
// Source file: /home/basta/Documents/bakalarka/bakalarka-openfoam/heat-sim-blender/simple.blend
// Export date: 2024-10-24 00:29:27.940838

internalFacesOnly true;

baffles
{

}
